arribada/linkit-v4-core/ports/nrf52840/core/hardware/smd_sat/smd_sat_cmd_at.cpp
void SmdSatCmdAt::get_kmac_status(uint8_t *status) {
	// AT interface has no direct KMAC status query
	// After KMAC load, status is OK if no error was returned
	*status = MAC_OK;
}

// ============================================================================
// Power / LPM
// ============================================================================

void SmdSatCmdAt::read_lpm(uint8_t *lpm_mode) {
	std::string data;
	if (send_at_with_data("AT+LPM=?", data) && !data.empty()) {
		try {
			*lpm_mode = static_cast<uint8_t>(std::stoul(data, nullptr, 16));
		} catch (...) {
			*lpm_mode = 0;
		}
	} else {
		throw ErrorCode::RESOURCE_NOT_AVAILABLE;
	}
}

void SmdSatCmdAt::write_lpm(uint8_t *lpm_mode) {
	char buf[8];
	snprintf(buf, sizeof(buf), "0x%02X", *lpm_mode);
	if (!send_at(std::string("AT+LPM=") + buf)) {
		throw ErrorCode::RESOURCE_NOT_AVAILABLE;
	}
}

// ============================================================================
// TCXO
// ============================================================================

void SmdSatCmdAt::read_tcxo_warmup(uint32_t *time_ms) {
	std::string data;
	if (send_at_with_data("AT+TCXO_WU=?", data) && !data.empty()) {
		try {
			*time_ms = std::stoul(data);
		} catch (...) {
			*time_ms = 0;
		}
	} else {
		throw ErrorCode::RESOURCE_NOT_AVAILABLE;
	}
}

void SmdSatCmdAt::write_tcxo_warmup(uint32_t time_ms) {
	if (!send_at("AT+TCXO_WU=" + std::to_string(time_ms))) {
		throw ErrorCode::RESOURCE_NOT_AVAILABLE;
	}
}

void SmdSatCmdAt::set_tcxo_warmup_internal(uint32_t time_s) {
	write_tcxo_warmup(time_s * 1000);
}

void SmdSatCmdAt::set_tcxo_control(bool state) {
	(void)state;
	// No AT equivalent for TCXO control — managed internally by SMD firmware
}

// ============================================================================
// TX
// ============================================================================

bool SmdSatCmdAt::initiate_tx(const KineisPacket &payload) {
	DEBUG_TRACE("SmdSatCmdAt::%s: Size: %u", __func__, payload.size());

	std::string hex = Binascii::hexlify(payload);

	m_tx_complete = false;
	m_tx_status = 0xFFFF;
	m_resp_error = false;
	m_resp_ok = false;
	m_tx_in_progress = true;  // arm +ERROR / +TX= async surfacing

	// Fire AT+TX NON-BLOCKING (was a 5 s busy-wait via send_at, which froze the
	// cooperative scheduler). The +OK (MAC acceptance) and the async
	// +TX=<status> completion are surfaced through is_tx_finished()/
	// is_tx_successful(), polled by the shared state machine — same contract as
	// the SPI backend, same async UART transport principle as KIM2.
	if (!send_string("AT+TX=" + hex + "\r\n")) {
		m_tx_in_progress = false;
		return false;
	}
	return true;
}

bool SmdSatCmdAt::is_tx_finished() {
	// C2 fix: initiate_tx() fires AT+TX non-blocking and the +TX=<status> completion
	// arrives asynchronously — it is parsed ONLY by process_rx(). The state machine
	// polls this accessor without otherwise running a send_at* (the only other
	// process_rx caller), so drain here or the completion is never parsed and every
	// TX times out.
	NrfUartAsync::process_rx();
	return m_tx_complete;
}

bool SmdSatCmdAt::is_tx_in_progress() {
	NrfUartAsync::process_rx();  // parse any pending async +TX= completion first
	return !m_tx_complete;
}

// ============================================================================
// Status
// ============================================================================

void SmdSatCmdAt::get_status(uint8_t *status) {
	// No direct AT equivalent — return OK if ping succeeds
	*status = ping() ? 0x00 : 0xFF;
}

void SmdSatCmdAt::read_spimac_state(uint8_t *spi_state, uint8_t *mac_state) {
	// No real AT MAC-state register — synthesize it. C1 fix: report TX_IN_PROGRESS
	// ONLY while a TX is actually in flight; once a TX completed report its verdict;
	// OTHERWISE (idle / no TX pending — e.g. during state_load_kmac at boot) report
	// MAC_OK so the mac_ready gate can pass (mirrors get_kmac_status()). The old code
	// returned MAC_TX_IN_PROGRESS whenever !m_tx_complete, which at boot (no TX ever
	// done) made load_kmac's gate permanently unreachable -> KMAC never loaded, TX
	// never started, per-session dead-end into cooldown.
	if (spi_state) *spi_state = 0;
	if (mac_state) {
		if (m_tx_in_progress)
			*mac_state = MAC_TX_IN_PROGRESS;
		else if (m_tx_complete)
			*mac_state = (m_tx_status == 0) ? MAC_TX_DONE : MAC_TX_TIMEOUT;
		else
			*mac_state = MAC_OK;  // idle / ready
	}
}

// ============================================================================
// Version / firmware info
// ============================================================================

void SmdSatCmdAt::read_version(uint8_t *version) {
	std::string data;
	if (send_at_with_data("AT+VERSION=?", data) && !data.empty()) {
		uint16_t len = std::min(static_cast<uint16_t>(data.size()), static_cast<uint16_t>(63));
		memcpy(version, data.c_str(), len);
		version[len] = 0;
	}
}

void SmdSatCmdAt::print_firmware_version() {
	std::string data;
	if (send_at_with_data("AT+FW=?", data)) {
		DEBUG_INFO("SmdSatCmdAt: FW=%s", data.c_str());
	}
}

void SmdSatCmdAt::read_firmware_info(uint8_t *info, uint16_t *len) {
	std::string data;
	if (send_at_with_data("AT+FW=?", data) && !data.empty()) {
		uint16_t copy_len = std::min(static_cast<uint16_t>(data.size()), *len);
		memcpy(info, data.c_str(), copy_len);
		*len = copy_len;
	} else {
		*len = 0;
	}
}

// ============================================================================
// CW / Prepass / UTC date
// ============================================================================

void SmdSatCmdAt::read_cw(uint8_t *cw_data, uint16_t *len) {
	(void)cw_data;
	*len = 0;
	// CW is set-only via AT+CW=<mode>,<freq>,<power>[,<period>]
}

void SmdSatCmdAt::write_cw(const uint8_t *cw_data, uint16_t len) {
	// CW data format: mode(1) + freq(4) + power(2) + optional period(2)
	if (len < 7) return;

	uint8_t mode = cw_data[0];
	int32_t freq = (int32_t)((cw_data[1]) | (cw_data[2] << 8) | (cw_data[3] << 16) | (cw_data[4] << 24));
	uint16_t power = cw_data[5] | (cw_data[6] << 8);

	char cmd[64];
	if (len >= 9) {
		uint16_t period = cw_data[7] | (cw_data[8] << 8);
		snprintf(cmd, sizeof(cmd), "AT+CW=%02x,%ld,%u,%u", mode, (long)freq, power, period);
	} else {
		snprintf(cmd, sizeof(cmd), "AT+CW=%02x,%ld,%u", mode, (long)freq, power);
	}

	send_at(cmd);
}

void SmdSatCmdAt::read_prepassen(uint8_t *prepass_data, uint16_t *len) {
	(void)prepass_data;
	*len = 0;
	// Prepass is a stub in AT firmware (always returns 0)
}

